Replace mermaid with plantuml (doesn't work in PDF)
